test_new/Lagrangian/injections/0/Lagrangian/dynamicParticle/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianVectorField;
    location    "0/Lagrangian/dynamicParticle";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            reboundVelocity;
        e               0.97;
        mu              0.09;
    }
}

sources
{
    volumeInjection
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    patchInjection
    {
        type            uniformFixedValue;
        uniformValue    (0 -0.02 0);
    }

    diskInjection
    {
        type            coneDiskVelocity;
        Umag            0.04;
        thetaInner      -5 [deg];
        thetaOuter      30 [deg];
    }
}


// ************************************************************************* //
