test_new/Lagrangian/injections/constant/Lagrangian/kinematicParticle/LagrangianModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/Lagrangian/kinematicParticle";
    object      LagrangianModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointInjection1
{
    type        pointInjection;
    point       (0 0 0) [cm];
    numberRate  10000;
}

pointInjection2
{
    type        pointInjection;
    point       (0 0 0) [cm];
    numberRate  10000;
}

pointInjection3
{
    type        pointInjection;
    point       (0 0 0) [cm];
    numberRate  10000;
}


// ************************************************************************* //
