test_new/Lagrangian/injections/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       2;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       3;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3;
        startFace       4;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3;
        startFace       7;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6;
        startFace       10;
    }
)

// ************************************************************************* //
